Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSetHandler Class
 The StraightDimensionSetHandler class contains operations for creating and modifying straight dimension sets.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.StraightDimensionSetHandler
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class StraightDimensionSetHandler
<SerializableAttribute>
Public NotInheritable Class StraightDimensionSetHandler
The StraightDimensionSetHandler type exposes the following members.
Constructors
Name | Description
StraightDimensionSetHandler
Initializes a new instance of the StraightDimensionSetHandler class
Top
Methods
Name | Description
CreateDimensionSet(ViewBase, PointList, Vector, Double)
 Creates straight dimensions and combines them to one straight dimension set. Returns null if fails.
CreateDimensionSet(ViewBase, PointList, Vector, Double, StraightDimensionSet.StraightDimensionSetAttributes)
 Creates straight dimensions and combines them to one straight dimension set. Returns null if fails.
CreateDimensionSet(ViewBase, PointList, Vector, Double, Double, Double)
 Creates straight dimensions and combines them to one straight dimension set. Returns null if fails.
CreateDimensionSet(ViewBase, PointList, Vector, Double, Double, Double, StraightDimensionSet.StraightDimensionSetAttributes)
 Creates straight dimensions and combines them to one straight dimension set. Returns null if fails.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace